## generate_sbom
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         NAME                         |
|----------|------------------------------------------------------|
| recreate | `aws_ecrpublic_repository.generate_sbom_public`      |
|          | `aws_ecrpublic_repository_policy.sbom_public_policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecrpublic_repository.generate_sbom_public must be replaced
-/+ resource "aws_ecrpublic_repository" "generate_sbom_public" {
      ~ arn             = "arn:aws:ecr-public::794722365809:repository/security-tools/generate_sbom/trivy" -> (known after apply)
      ~ id              = "security-tools/generate_sbom/trivy" -> (known after apply)
      ~ registry_id     = "794722365809" -> (known after apply)
      ~ repository_name = "security-tools/generate_sbom/trivy" -> "security-tools/generate_sbom/trivy-db" # forces replacement
      ~ repository_uri  = "public.ecr.aws/v2v0c4z5/security-tools/generate_sbom/trivy" -> (known after apply)
        tags            = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-generate_sbom"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)

      - catalog_data {}
    }

  # aws_ecrpublic_repository_policy.sbom_public_policy must be replaced
-/+ resource "aws_ecrpublic_repository_policy" "sbom_public_policy" {
      ~ id              = "security-tools/generate_sbom/trivy" -> (known after apply)
      ~ registry_id     = "794722365809" -> (known after apply)
      ~ repository_name = "security-tools/generate_sbom/trivy" -> "security-tools/generate_sbom/trivy-db" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
